Revit 2027 API
BuiltInFailures.SketchFailures.BentFabricSheetTooShortSegments Property
 A segment in the bend profile is too short to apply the wire bend diameter. The bent fabric sheet of the selected type cannot be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BentFabricSheetTooShortSegments { get; }
Public Shared ReadOnly Property BentFabricSheetTooShortSegments As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BentFabricSheetTooShortSegments {
	FailureDefinitionId^ get ();
}
static member BentFabricSheetTooShortSegments : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace